{
  "core_worldview": {
    "game_style": "这是一个充满绝望与背叛的赛博朋克废土世界，人类文明在核战争后沦为企业财团的奴隶。机械义体改造让人性逐渐泯灭，记忆可被随意篡改，灵魂在钢铁躯壳中腐烂。每个人都在为生存而出卖他人，救赎只是虚假的幻象，真相永远比想象更加残酷。",
    "world_basic_setting": "2157年，第三次世界大战后的废土上，人类文明几近毁灭。幸存者聚集在被称为\"钢铁坟场\"的巨型城市中，这里由三大企业财团统治：负责记忆改造的\"遗忘公司\"、掌控义体技术的\"血肉工厂\"、垄断能源供应的\"黑日集团\"。城市分为七个区域，越往上层越接近权力中心，底层贫民窟中充斥着辐射变异者和被抛弃的残次品改造人。社会等级森严，普通人只能通过出卖身体进行义体改造来获得更高地位，但每次改造都会丧失部分人性和记忆。文化已经扭曲，人们崇拜机械，鄙视血肉，亲情友情都可以用芯片数据替代。关键历史事件包括\"血色星期三\"大屠杀、\"记忆清洗计划\"、\"最后的抵抗者\"起义失败等，每次反抗都以更残酷的镇压告终。",
    "protagonist_ability": "拥有罕见的\"记忆免疫\"基因，无法被常规手段洗脑或篡改记忆，但这种能力带来的是无尽的痛苦——他必须承受所有被强制遗忘的残酷真相。同时具备初级黑客技能和基础格斗能力，但在这个强者为王的世界中显得微不足道。最重要的是，他体内植入了一个神秘的\"救赎协议\"程序，但激活条件和真正用途都是未知的。",
    "main_quest": "林墨必须在追杀中寻找父亲留下的真相碎片，逐步解开\"救赎协议\"的秘密。他需要潜入三大企业财团的核心设施，获取被封存的记忆数据，同时面对来自苏雨的情感纠葛和道德考验。最终他将发现，所谓的救赎需要以整个城市的毁灭为代价，包括那些无辜的底层民众。他必须在个人复仇、拯救他人和自我毁灭之间做出选择，但无论如何选择，都将付出惨重的代价，真正的救赎或许根本不存在。",
    "end_trigger_condition": "当林墨的精神状态降至临界点，或者\"救赎协议\"被完全激活，或者他选择放弃一切自我了断时，游戏将进入结局阶段。所有的结局都是悲剧性的：要么城市毁灭但腐朽的制度依然存在，要么林墨死去但什么都没有改变，要么他活下来但失去了所有珍视的东西。真正的救赎永远不会到来，只有无尽的痛苦和绝望在循环。",
    "characters": {},
    "forces": {
      "positive": [
        "地下抵抗组织\"记忆守护者\"，由幸存的原抵抗者成员组成，人数稀少且装备落后，大多数成员都有着痛苦的过往，他们试图保护那些未被改造的纯净记忆，但内部也存在着背叛和分歧。"
      ],
      "negative": [
        "企业财团三巨头形成的统治联盟，掌控着城市的一切资源和信息，他们将人类视为可随意改造的原材料，通过记忆篡改和义体控制维持着残酷的统治秩序，内部也在进行着血腥的权力斗争。"
      ],
      "neutral": [
        "底层的拾荒者联盟，为了生存可以与任何势力合作，他们掌握着城市废墟中的秘密通道和隐藏资源，但随时可能为了利益出卖任何人，是最不可靠但又不可或缺的存在。"
      ]
    },
    "chapters": {
      "chapter1": {
        "conflict_end_condition": "林墨成功潜入遗忘公司的数据库，获取了第一段关于父亲的记忆碎片，但同时也暴露了自己的位置，被迫与苏雨一同逃离，开始了更加危险的逃亡之旅。",
        "main_conflict": "第1章的核心矛盾待定义"
      },
      "chapter2": {
        "conflict_end_condition": "苏雨的真实身份被部分揭露，林墨在愤怒和绝望中激活了\"救赎协议\"的第一阶段，导致整个底层区域的控制系统瘫痪，但也造成了大量平民的死伤，让他陷入更深的道德困境。",
        "main_conflict": "第2章的核心矛盾待定义"
      },
      "chapter3": {
        "conflict_end_condition": "林墨做出最终选择，无论是激活协议还是自我毁灭，都将导致悲剧性的结局。城市的命运被决定，但救赎依然遥不可及，只有更深的绝望和无尽的循环。",
        "main_conflict": "第3章的核心矛盾待定义"
      }
    }
  },
  "flow_worldline": {
    "current_chapter": "chapter1",
    "characters": {},
    "environment": {}
  }
}