{
  "global_state": {
    "core_worldview": {
      "chapters": {
        "chapter1": {
          "conflict_end_condition": "主角必须成功进行第一次完整的死亡回溯，回到死亡前的时间点并获得关键信息，同时初步掌握能力的使用方法。他需要在保持理智的前提下，确认至少一个可信赖的盟友或识别出一个明确的敌人，为后续的调查奠定基础。",
          "main_conflict": "主角发现自己的尸体后陷入现实与超自然的认知冲突中，他必须接受自己已经死亡的事实，同时学会控制死亡回溯能力。在这个过程中，他开始怀疑身边每一个人的真实动机，包括看似友善的山田花音和其他同学。学校管理层开始注意到主角的异常行为，暗中加强对他的监视，而邪教组织也察觉到了他能力的觉醒，开始布置更加复杂的陷阱。主角在寻找真相的过程中不断遭遇超自然现象和心理创伤，理智值持续下降。"
        },
        "chapter2": {
          "conflict_end_condition": "主角必须做出关键选择，决定是否信任山田花音，并且成功阻止一次针对他的暗杀行动。他需要获得足够的证据来证明邪教组织的存在，同时找到进入组织核心的方法，为最终对决做好准备。",
          "main_conflict": "主角深入调查学校的黑暗历史，发现了\"永恒夏日\"邪教组织的存在和自己姐姐死亡的真相。山田花音的双重身份开始暴露，她在帮助主角和执行组织任务之间痛苦挣扎，这种内心冲突让她的行为变得不可预测。邪教组织意识到主角的威胁性，开始采取更加直接的行动来消除他，包括操控其他学生对他进行孤立和迫害。同时，烟花节的准备工作如火如荼地进行着，但主角发现这个节日实际上是一个巨大的血祭仪式的掩护。"
        },
        "chapter3": {
          "conflict_end_condition": "主角必须在烟花节结束前成功破坏邪教仪式，但这个胜利将付出巨大的代价，可能包括山田花音的死亡、自己能力的永久丧失或者其他无辜生命的牺牲。最终的结局将是悲剧性的，即使阻止了仪式，真相的揭露也不会带来真正的救赎，只会暴露人性更深层的黑暗。",
          "main_conflict": "烟花节当晚，邪教组织的终极仪式正式开始，主角必须在有限的时间内阻止大规模的血祭，拯救包括自己在内的所有潜在受害者。山田花音面临最终的选择，她必须决定是继续效忠组织还是帮助主角，这个选择将决定她和主角的最终命运。学校的所有黑暗秘密都将在这一夜暴露，包括管理层的腐败、历年受害者的真相和邪教组织的终极目标。主角的死亡回溯能力将面临最严峻的考验，他可能需要多次死亡才能找到阻止仪式的正确方法。"
        }
      },
      "characters": {
        "主角": {
          "core_personality": "主角是一个内向而敏感的学生，拥有强烈的正义感但缺乏表达的勇气。他习惯于观察和思考，对周围的异常现象有着敏锐的直觉，但往往被他人视为多疑和神经质。面对困境时，他倾向于独自承担而不愿意连累他人，这种性格既是他的优点也是致命弱点。他对死亡有着异常的恐惧，却又被死亡的真相深深吸引，这种矛盾的心理状态让他在生死边缘徘徊。",
          "deep_background": "田中诚的真实身份是一名被派遣到学校进行秘密调查的少年侦探，他的父亲是一名因为调查樱丘学校而神秘失踪的私家侦探。三年前，田中诚的姐姐田中美雪曾经是这所学校的学生，在烟花节当晚从宿舍楼顶坠落身亡，官方判定为自杀，但田中诚始终不相信这个结论。他发现姐姐在死前留下了一本加密的日记，记录着学校内部的黑暗秘密和一个名为\"永恒夏日\"的邪教组织的活动。为了查明真相，田中诚伪造了转学手续潜入学校，但他不知道的是，自己的身份早已被学校的管理层识破，他们正在利用他作为新一轮仪式的祭品。更可怕的是，田中诚体内流淌着特殊的血脉，这种血脉是邪教组织进行终极仪式所必需的关键要素，而他的死亡回溯能力正是这种血脉觉醒的表现。",
          "shallow_background": "主角名叫田中诚，是樱丘高等学校二年级的转学生，因为父母工作调动而被迫转入这所偏远的学校。他在班级中没有亲密的朋友，经常独自一人度过课余时间。老师和同学们都认为他是一个普通而安静的学生，成绩中等，不参与任何社团活动。他住在学校宿舍的单人间，房间号是217，这个房间曾经住过三个学生，但都在烟花节期间发生了意外。田中诚对学校的历史和传说表现出异常的兴趣，经常在图书馆查阅相关资料。"
        },
        "配角1": {
          "core_personality": "山田花音是一个表面上开朗活泼的女学生，但内心深处隐藏着深深的绝望和仇恨。她善于伪装自己的真实情感，在他人面前总是展现出完美的笑容，但这种伪装已经成为了她的本能反应。她对主角表现出特殊的关注和好感，但这种关注背后隐藏着复杂的动机。她拥有极强的观察力和操控他人情感的能力，经常在关键时刻给主角提供看似有用但实际上具有误导性的信息。",
          "deep_background": "山田花音的真实身份是\"永恒夏日\"邪教组织安插在学校的核心成员，她的任务是监视和引导特定的目标学生走向死亡。她的父母在她很小的时候就将她卖给了邪教组织，从那时起她就被训练成为完美的诱饵和杀手。花音曾经亲手杀死过七名学生，包括田中诚的姐姐田中美雪，每一次杀戮都让她的内心更加扭曲和空虚。她对田中诚的接近并非偶然，而是接到了将他引导至死亡的明确指令。然而，在与田中诚的接触过程中，她开始体验到从未有过的真实情感，这让她陷入了痛苦的内心挣扎。她发现自己无法像对待其他受害者一样冷酷地对待田中诚，但背叛组织的后果将是比死亡更可怕的折磨。花音的房间里隐藏着一个秘密祭坛，她每晚都要在那里进行血腥的仪式，以维持自己年轻的外表和超自然的能力。她知道田中诚拥有死亡回溯的能力，并且正在暗中帮助他开发这种能力，因为只有当他的能力达到顶峰时，他的死亡才能为组织带来最大的价值。",
          "shallow_background": "山田花音是主角的同班同学，担任班级的文艺委员，负责组织烟花节的表演活动。她在学校里很受欢迎，被誉为\"樱丘的天使\"，成绩优秀，多才多艺，是老师和学生们眼中的模范生。她住在女生宿舍的301号房间，经常在晚上帮助其他学生解决学习和生活上的问题。花音对主角表现出特殊的友善，主动与他交谈，邀请他参加各种活动，是主角在学校里为数不多的\"朋友\"之一。她似乎对学校的历史也很了解，经常向主角讲述各种校园传说。"
        }
      },
      "end_trigger_condition": "游戏有多个结束条件，包括主角彻底死亡且无法再次回溯、理智值降为零导致精神崩溃、烟花节仪式成功完成、或者主角选择放弃调查接受现实。每种结局都带有浓重的悲剧色彩，即使是相对\"成功\"的结局也会伴随着巨大的牺牲和无法挽回的损失。最残酷的结局是主角发现自己从一开始就是邪教组织计划的一部分，他的所有努力都只是在按照既定的剧本行动，真相的揭露反而加速了悲剧的发生。",
      "forces": {
        "negative": [
          "\"永恒夏日\"邪教组织，一个以追求永生和超自然力量为目标的秘密宗教团体，他们将樱丘学校作为进行人体实验和血祭仪式的基地，拥有强大的财力和政治影响力，能够掩盖所有的罪行，与主角的关系是猎人与猎物，视主角为珍贵的祭品；学校管理层腐败集团，由校长、教务主任等高层组成的利益共同体，他们与邪教组织合作，为其提供学生作为实验对象，以换取金钱和权力，同时维护学校表面的正常运作，与主角的关系是表面的权威者实际的敌人。"
        ],
        "neutral": [
          "普通学生群体，大部分学生对学校的黑暗真相一无所知，他们只是想正常完成学业，但在无意中可能成为主角的助力或阻碍，他们的态度会根据主角的行动而发生变化，与主角的关系是复杂多变的；当地政府部门，包括警察和教育局等机构，他们表面上维护法律和秩序，但实际上受到邪教组织的渗透和控制，对学校发生的异常事件采取漠视或掩盖的态度，与主角的关系是名义上的保护者实际上的障碍。"
        ],
        "positive": [
          "地下抵抗组织\"真相之光\"，由几名曾经的受害者家属和良心未泯的前教职工组成，他们秘密调查学校的黑暗真相，试图拯救更多的学生，但力量微弱且行动受限，经常面临被发现和清除的危险，与主角的关系是潜在的盟友但初期互不知情；受害者灵魂联盟，由历年来在学校死去的学生灵魂组成的超自然势力，他们试图通过各种方式向生者传递警告和线索，帮助阻止更多的悲剧发生，但他们的力量有限且容易被邪教组织的仪式压制，与主角的关系是引导者和信息提供者。"
        ]
      },
      "game_style": "这是一个充满压抑与绝望的校园悬疑游戏，以夏日烟花节为背景，却隐藏着死亡与背叛的阴霾。游戏采用第一人称视角，让玩家体验主角从发现自己尸体开始的扭曲现实。整体氛围阴暗沉重，充斥着人性的丑恶面，每个角色都隐藏着不可告人的秘密，看似美好的校园生活实则是一个巨大的谎言陷阱，真相往往比表象更加残酷和绝望。",
      "main_quest": "主角必须在烟花节当晚之前揭露樱丘学校和\"永恒夏日\"邪教组织的真相，阻止即将进行的大规模血祭仪式，并为包括自己姐姐在内的所有受害者报仇雪恨。任务的第一步是收集证据，通过调查学校的历史档案、受害者的遗物和目击者的证言来拼凑出完整的真相。第二步是识别敌友，在复杂的人际关系中找出真正的盟友，同时避免被敌人发现自己的真实身份。第三步是破坏仪式，利用自己的死亡回溯能力和收集到的信息，在关键时刻阻止邪教组织的终极计划。然而，这个任务充满了不可预知的危险和道德困境，主角可能需要做出痛苦的选择，甚至牺牲无辜的人来达成目标。最终的挑战在于，即使成功阻止了仪式，主角也可能无法拯救所有人，包括他自己，因为有些伤害已经无法挽回，有些真相比无知更加残酷。",
      "protagonist_ability": "主角拥有一种被称为\"死亡回溯\"的超自然能力，这种能力让他能够在死亡后以灵魂状态观察自己的尸体和周围发生的事情，并在特定条件下回到死亡前的某个时间点。这种能力的触发需要强烈的执念和未完成的愿望作为驱动力，每次使用都会消耗主角的生命力和理智值。回溯的时间长度取决于主角的意志力和对真相的渴望程度，但每次回溯都会带来巨大的痛苦和记忆混乱。能力的限制在于主角无法改变已经发生的重大事件，只能通过不同的选择影响事件的发展轨迹，而且过度使用这种能力可能导致主角彻底迷失在死亡与现实的边界中，最终变成游荡的怨灵。",
      "world_basic_setting": "故事发生在日本某个偏远山区的私立樱丘高等学校，这所学校建立在一个曾经发生过大规模自杀事件的废弃村庄遗址上。学校采用封闭式管理，学生们被困在这个与世隔绝的环境中。每年夏天的烟花节是学校唯一的大型活动，但这个节日背后隐藏着血腥的传统——每年都会有学生在烟花节当晚神秘死亡或失踪。学校的管理层由校长、教务主任和几名资深教师组成，他们形成了一个秘密的权力集团，控制着学生的生死。学校分为三个年级，每个年级都有严格的等级制度，高年级学生拥有对低年级学生的绝对权威。校园内存在多个禁区，包括废弃的旧校舍、地下室和后山的神社遗址。这些地方经常发生超自然现象，学生们传说那里埋葬着过去受害者的怨念。学校的资金来源不明，据说与某个神秘的宗教组织有关，该组织进行着以学生为实验对象的邪恶仪式。校园内的监控系统异常发达，但奇怪的是，每当发生死亡事件时，相关的监控录像总是会神秘消失。学生宿舍按照特殊的规则分配，某些房间被标记为\"特殊用途\"，住进这些房间的学生往往会发生不幸。"
    },
    "flow_worldline": {
      "chapter_conflict_solved": false,
      "chapter_progress": 12.6,
      "characters": {},
      "current_chapter": "chapter1",
      "current_scene": "你紧紧盯着山田花音，不愿意放过任何细节。今年的仪式到底有什么不同？你刚才说他们的目标更加宏大，具体是什么意思？你的声音带着一丝急迫。山田花音的身体开始微微颤抖，她环顾四周，确认没有人注意到这里后，压低声音说道：今年烟花节当晚，他们计划进行永恒收割仪式。这不是普通的单人献祭，而是要同时收集七个拥有特殊血脉的学生。她的眼中闪过恐惧的光芒，他们已经秘密标记了目标，其中包括一些转学生和有特殊家庭背景的学生。仪式地点就在后山的废弃神社，那里有一个古老的祭坛。山田花音突然抓住你的手臂，田中同学，我知道这听起来很疯狂，但你必须相信我。组织已经开始最后的准备工作了，他们在学校地下室储存了大量的仪式用品，包括一些我不敢描述的东西。她的声音变得更加颤抖，而且，我听说他们这次要使用一种特殊的药物，让目标学生在仪式开始前就失去反抗能力。",
      "environment": {},
      "quest_progress": "主角成功获得了今年烟花节仪式的具体计划信息，了解到\"永恒收割\"仪式的规模和目标。这一重大进展让主角意识到危险的紧迫性，同时也为他制定阻止计划提供了关键情报。主角现在需要进一步确认目标学生的身份，寻找破坏仪式的方法，并且开始怀疑山田花音的真实身份和她获得这些信息的原因。"
    }
  },
  "protagonist_attr": {
    "体力": "普通",
    "智商": "普通",
    "颜值": "普通",
    "魅力": "普通"
  },
  "difficulty": "困难",
  "last_options": [
    "询问如何识别被标记的目标学生",
    "要求她带你去看地下室的仪式用品",
    "追问她为什么知道这些内部信息",
    "询问是否有办法破坏这个仪式"
  ],
  "timestamp": "2026-01-20 13:29:48.933162"
}